       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'STOKAKT'.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. RMCOBOL.
       OBJECT-COMPUTER. RMCOBOL.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
       copy 'stok.cpy'.
       DATA DIVISION.
       FILE SECTION.
       copy 'stok.cpz'.
       WORKING-STORAGE SECTION.
       copy 'status.cpy'.
       PROCEDURE DIVISION.
       START-PROGRAM.
           OPEN OUTPUT STOK STOKBAG PASSTOK STOKARA.
		   CLOSE STOK STOKBAG PASSTOK STOKARA.
		   STOP RUN.
           