			SELECT USERACCESS ASSIGN TO DISK, 'DATA\ACCESS.DAT'
                        ORGANIZATION INDEXED
                        ACCESS MODE IS DYNAMIC
                        RECORD KEY IS UA-KEY
                        FILE STATUS IS ST-USERACCESS.