           SELECT AYAR ASSIGN TO DISK, 'DATA\AYAR.DAT'
                ORGANIZATION INDEXED
                ACCESS MODE IS DYNAMIC
                RECORD KEY IS AY-KEY
                FILE STATUS IS ST-AYAR.
           