       IDENTIFICATION DIVISION.
       PROGRAM-ID. 'CTEST'.
       AUTHOR. FIKRET.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       SOURCE-COMPUTER. RMCOBOL.
       OBJECT-COMPUTER. RMCOBOL.
       SPECIAL-NAMES.
           CLASS DIGIT IS "0123456789"
           DECIMAL-POINT IS COMMA.
       INPUT-OUTPUT SECTION.
       FILE-CONTROL.
                  SELECT YAZICI ASSIGN TO PRINT, 'LPT3:'.
       DATA DIVISION.
       FILE SECTION.
       FD YAZICI LABEL RECORD OMITTED.
       01 YAZ               PIC X(140).
       WORKING-STORAGE SECTION.
       01 YAZICI-VARIABLES.
           02 NORMAL        PIC X VALUE ''.
           02 KUCUK         PIC X VALUE ''.
           02 YSATIR            PIC X(250).
	   01 A4-SAYFA.
           02 FILLER     PIC X(3) VALUE X'1B4342'.
       01 A5-SAYFA.
           02 FILLER     PIC X(3) VALUE X'1B4321'.
       01 SONRAKI-SAYFA.
           02 FILLER     PIC X VALUE X'0C'.
              
       PROCEDURE DIVISION.
	   BASLA.
	       OPEN OUTPUT YAZICI.
           WRITE YAZ FROM A4-SAYFA.
           WRITE YAZ FROM 'FIKRET PIRIM'.
		   WRITE YAZ FROM SONRAKI-SAYFA.
           WRITE YAZ FROM A5-SAYFA.
           WRITE YAZ FROM 'FIKRET PIRIM'.
		   WRITE YAZ FROM SONRAKI-SAYFA.
           WRITE YAZ FROM 'FIKRET PIRIM'.
           WRITE YAZ FROM SONRAKI-SAYFA.
           WRITE YAZ FROM 'FIKRET PIRIM'.
           
      *     WRITE YAZ FROM ' ' AFTER PAGE.
           CLOSE YAZICI.
