       IDENTIFICATION DIVISION.
       PROGRAM-ID. '_DENEME'.
       AUTHOR. FIKRET PIRIM.
       ENVIRONMENT DIVISION.
       CONFIGURATION SECTION.
       DATA DIVISION.
       WORKING-STORAGE SECTION.
	   77 DUR			PIC X.
	   PROCEDURE DIVISION.
       BASLA.
	       DISPLAY 'FİKRET'.
           ACCEPT DUR NO BEEP.
		   EXIT PROGRAM.
           STOP RUN.