            SELECT DEPO ASSIGN TO DISK, 'DATA\DEPO.DAT'
                    ORGANIZATION INDEXED
                    ACCESS MODE IS DYNAMIC
                    RECORD KEY IS DP-KEY
                    FILE STATUS IS ST-DEPO.
         