           SELECT KASA ASSIGN TO DISK, 'DATA\KASA.DAT'
               ORGANIZATION INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS KS-KEY
               ALTERNATE RECORD KEY KS-MAKBUZ WITH DUPLICATES
               FILE STATUS IS ST-KASA.