           SELECT KATLOG ASSIGN TO DISK, 'DATA\KATLOG.DAT'
               ORGANIZATION INDEXED
               ACCESS MODE IS DYNAMIC
               ALTERNATE RECORD KEY IS KT-ACIKLAMA WITH DUPLICATES
               RECORD KEY IS KT-KEY
               FILE STATUS IS ST-KATLOG.
