           SELECT MAKBUZ ASSIGN TO DISK, 'DATA\MAKBUZ.DAT'
                ORGANIZATION INDEXED
                ACCESS MODE IS DYNAMIC
                ALTERNATE RECORD KEY IS MK-TARIH WITH DUPLICATES
                RECORD KEY IS MK-KEY
                FILE STATUS IS ST-MAKBUZ.
