           SELECT ODEME ASSIGN TO DISK, 'DATA\ODEME.DAT'
               ORGANIZATION INDEXED
               ACCESS MODE IS DYNAMIC
               ALTERNATE RECORD KEY IS OD-ADI WITH DUPLICATES
               RECORD KEY IS OD-KEY
               FILE STATUS IS ST-ODEME.
