       77 E-ONAY            PIC X.
       77 ONAY-MESSAGE      PIC X(43) VALUE ALL SPACES.
       77 F-ONAY            PIC 9999.
       77 INTERRUPT         PIC 9.