           SELECT PLASIYER ASSIGN TO DISK, 'DATA\PLASIYER.DAT'
               ORGANIZATION INDEXED
               ACCESS MODE IS DYNAMIC
               ALTERNATE RECORD KEY IS PL-ADI WITH DUPLICATES
               RECORD KEY IS PL-KEY
               FILE STATUS IS ST-PLASIYER.
