           SELECT SAYIM ASSIGN TO DISK, 'DATA\SAYIM.DAT'
               ORGANIZATION INDEXED
               ACCESS MODE IS DYNAMIC
               RECORD KEY IS SY-KEY
               FILE STATUS IS ST-SAYIM.
           