            SELECT SICILPOS ASSIGN TO DISK, 'DATA\SICILPOS.DAT'
                    ORGANIZATION INDEXED
                    ACCESS MODE IS DYNAMIC
                    RECORD KEY IS SP-KEY
                    FILE STATUS IS ST-SICILPOS.
