            SELECT SICILTEL ASSIGN TO DISK, 'DATA\SICILTEL.DAT'
                    ORGANIZATION INDEXED
                    ACCESS MODE IS DYNAMIC
                    RECORD KEY IS SCT-KEY
                    FILE STATUS IS ST-SICILTEL.
