            SELECT SICILKOD ASSIGN TO DISK, 'DATA\SICILKOD.DAT'
                    ORGANIZATION INDEXED
                    ACCESS MODE IS DYNAMIC
                    RECORD KEY IS SK-KEY
                    FILE STATUS ST-SICILKOD.