            SELECT SICIL ASSIGN TO DISK, 'DATA\SICIL.DAT'
                    ORGANIZATION INDEXED
                    ACCESS MODE IS DYNAMIC
                    ALTERNATE RECORD KEY SC-HESAPADI WITH DUPLICATES
                    ALTERNATE RECORD KEY SC-YETKILI WITH DUPLICATES
                    RECORD KEY IS SC-KEY
                    FILE STATUS IS ST-SICIL.
