           SELECT DTIP ASSIGN TO DISK, 'DATA\TIP.DAT'
                ORGANIZATION INDEXED
                ACCESS MODE IS DYNAMIC
                RECORD KEY IS DTIP-KEY
                FILE STATUS IS ST-DTIP.
           