            SELECT TIPKOD ASSIGN TO DISK, 'DATA\TIPKOD.DAT'
                    ORGANIZATION INDEXED
                    ACCESS MODE IS DYNAMIC
                    RECORD KEY IS TK-KEY
                    FILE STATUS IS ST-TIPKOD.
