           OPEN INPUT USERACESS.
		   MOVE G-NAME TO UA-NAME.
		   READ USERACCESS INVALID KEY
		        MOVE ZEROS TO UA-READ UA-WRITE UA-UPDATE UA-DELETE.	 
		   CLOSE USERACCESS.