			SELECT USERS ASSIGN TO DISK, 'DATA\USERS.DAT'
                        ORGANIZATION INDEXED
                        ACCESS MODE IS DYNAMIC
                        RECORD KEY IS US-KEY
                        FILE STATUS IS ST-USERS.